"""
Вычисления ряда с точностью eps (вариант 1)

Автор: Сорокин Антон ИУ7-12Б

Переменные:
x - аргумента
eps - точность
nmax - максимальное количество итераций
step - шаг
s - сумма ряда
a - текущий член ряда
k - номер итерации
iter_str - рабочая переменная (строчка со словом "итерация" в падеже)
"""
x = float(input('Введите значение аргумента x: '))
eps = float(input('Введите точность: '))
nmax = int(input('Введите максимальное количество итераций: '))
step = int(input('Введите шаг: '))

#Шапка таблицы
print(35*'\u2500')
print(6*' ','ТАБЛИЦА ЗНАЧЕНИЙ РЯДА',sep='')
print(35*'\u2500')
print('\nk - номер итерации')
print('x - значение аргумента')
print('a - текущий член ряда')
print('s - текущее значение суммы\n')
print('\u250c',5*'\u2500','\u252c',15*'\u2500','\u252c',15*'\u2500','\u252c',
      15*'\u2500','\u2510',sep='')
print('\u2502','  k  ','\u2502',7*' ','x',7*' ','\u2502',7*' ','a',7*' ',
      '\u2502',7*' ','s',7*' ','\u2502',sep='')
print('\u251c',5*'\u2500','\u253c',15*'\u2500','\u253c',15*'\u2500','\u253c',
      15*'\u2500','\u2524',sep='')

#Вывод таблицы и вычисление суммы
a = 1
k = 1
s = a
print('\u2502','{:5d}'.format(k),'\u2502',sep = '',end = '')
if 1e-4 < abs(x) < 10**8:
    print('{:15.4f}'.format(x),'\u2502',sep = '',end = '')
else:
    print('{:15.4e}'.format(x),'\u2502',sep = '',end = '')
if 1e-4 < abs(a) < 10**8:
    print('{:15.4f}'.format(a),'\u2502',sep = '',end = '')
else:
    print('{:15.4e}'.format(a),'\u2502',sep = '',end = '')
if 1e-4 < abs(s) < 10**8:
    print('{:15.4f}'.format(s),'\u2502',sep = '')
else:
    print('{:15.4e}'.format(s),'\u2502',sep = '')

while (abs(a) >= eps) and (k < nmax):
    a *= x/k
    s += a
    k += 1
    if (k-1) % step == 0:
        print('\u2502','{:5d}'.format(k),'\u2502',sep = '', end = '')
        if 1e-4 < abs(x) < 10**8:
            print('{:15.4f}'.format(x),'\u2502',sep = '',end = '')
        else:
            print('{:15.4e}'.format(x),'\u2502',sep = '',end = '')
        if 1e-4 < abs(a) < 10**8:
            print('{:15.4f}'.format(a),'\u2502',sep = '',end = '')
        else:
            print('{:15.4e}'.format(a),'\u2502',sep = '',end = '')
        if 1e-4 < abs(s) < 10**8:
            print('{:15.4f}'.format(s),'\u2502',sep = '')
        else:
            print('{:15.4e}'.format(s),'\u2502',sep = '')
print('\u2514',5*'\u2500','\u2534',15*'\u2500','\u2534',15*'\u2500','\u2534',
      15*'\u2500','\u2518',sep = '')
print()

if abs(a) >= eps:
    print('Ряд не сошёлся.')
else:
    iter_str = 'итераций.'
    if not(10 < k % 100 < 20):
        if (k % 10 == 1):
            iter_str = 'итерацию.'
        elif (1 < k % 10 < 5):
            iter_str = 'итерации.'
    print('Ряд сошёлся за {:d} '.format(k),iter_str,sep = '')
    print('Сумма ряда:',s)
